{
  "name": "Mark Austero",
  "email": "",
  "phone": "",
  "location": "",
  "summary": "I am a results-driven and detail-oriented professional with over 8 years of combined experience as a Medical Virtual Assistant, Real Estate Virtual Assistant, and BPO Customer Experience Associate. Throughout my career, I have developed a strong foundation in remote operations, administrative support, and client-facing communication. I specialize in streamlining workflows, managing sensitive information with accuracy and confidentiality, and delivering exceptional services across various industries. With a proven track record in healthcare coordination, real estate transaction management, and customer support, I bring a high level of reliability, adaptability, and professionalism to every task. I am now seeking to contribute my well-rounded expertise to a dynamic team where I can continue to grow while driving operational success and client satisfaction.",
  "skills": [
    "Administrative & Remote Operations Management",
    "Sales Support & Patient Communication",
    "CRM & Workflow Management",
    "Technical Tools & Digital Proficiency",
    "Active Listening and Patient Engagement",
    "Empathy and Compassionate Communication",
    "Attention to Detail in Records and Documentation",
    "Time Management in Scheduling and Follow-Ups",
    "Discretion and Confidentiality (HIPAA Compliance)",
    "Organizational Efficiency in Managing Tasks and Calendars",
    "Multitasking in Fast-Paced Clinical Environments",
    "Professionalism in Patient and Provider Interactions",
    "Adaptability to Changing Clinic Needs and Systems",
    "Clear and Respectful Verbal and Written Communication",
    "Emotional Intelligence in Handling Sensitive Patient Concerns",
    "Dependability in Managing Critical Administrative Functions",
    "Problem Solving for Scheduling Conflicts and Process Gaps",
    "Collaboration with Clinical and Administrative Teams"
  ],
  "experience": [
    {
      "company": "CareBridge Medical Solutions",
      "position": "Medical Administrative Support",
      "duration": "September 2021— March 2025",
      "description": [
        "Provided comprehensive remote administrative support to physicians and clinical teams.",
        "Scheduled and managed patient appointments, follow-ups, and provider calendars using Elation, DrChrono, and Kareo.",
        "Verified insurance eligibility and processed prior authorizations for procedures and treatments.",
        "Updated and maintained Electronic Health Records (EHR) accurately.",
        "Handled patient intake, onboarding, consent forms, and pre-visit documentation.",
        "Managed secure multichannel communication with patients, pharmacies, and insurance reps.",
        "Used Dock Health and Elevate to monitor daily provider tasks.",
        "Created internal SOPs and administrative guides.",
        "Designed patient-facing materials using Google Workspace and Canva.",
        "Triaged patient concerns and escalated urgent medical inquiries.",
        "Collaborated with providers to ensure patient readiness and optimized scheduling.",
        "Maintained confidentiality in all data handling processes."
      ]
    },
    {
      "company": "Malcolm Seals Realty",
      "position": "Real Estate Cold Caller",
      "duration": "April 2018 – July 2021",
      "description": [
        "Served as a dedicated Real Estate Cold Caller and Lead Generation Specialist.",
        "Conducted 100–200 outbound cold calls daily using multi-line dialers.",
        "Pre-qualified leads by gathering essential information.",
        "Scheduled appointments for acquisition specialists and real estate agents.",
        "Utilized CRM systems such as Podio and Salesforce.",
        "Performed property and market research using platforms like Zillow, Redfin, PropStream.",
        "Customized follow-up strategies based on lead status.",
        "Delivered strong objection-handling and active listening skills.",
        "Collaborated closely with the acquisition team.",
        "Assisted in improving cold calling scripts and lead qualification criteria.",
        "Tracked daily call metrics, appointment rates, and conversion statistics."
      ]
    },
    {
      "company": "FOUNDEVER (formerly Sitel)",
      "position": "Customer Service Representative",
      "duration": "September 2016 – February 2018",
      "description": [
        "Provided technical, billing, and account-related support for U.S. clients.",
        "Handled 80–100 daily customer interactions via phone, chat, and email.",
        "Delivered first-contact resolution by actively listening to concerns.",
        "Maintained an average 90% CSAT score.",
        "Navigated internal systems to provide timely information.",
        "Collaborated with team leads to improve call scripts.",
        "Mentored new agents by demonstrating call handling best practices."
      ]
    }
  ],
  "education": [
    {
      "institution": "Our Lady of Fatima (OLFU)",
      "degree": "Bachelor’s Degree in Nursing",
      "year": ""
    }
  ],
  "tools": {
    "communication_tools": [
      "Zoom",
      "Ms Teams",
      "Ringcentral",
      "Grasshopper"
    ],
    "scheduling_tools": [
      "Calendly",
      "Outlook Calendar",
      "Zocdoc"
    ],
    "productivity_tools": [
      "Google Workspace",
      "Microsoft Office Suite",
      "Canva"
    ],
    "medical_va_tools": [
      "DrChrono",
      "Kareo",
      "Athenahealth"
    ]
  },
  "certifications": [
    "HIPAA Compliance Training Certification",
    "Medical Terminology Certification",
    "Real Estate Virtual Assistant Bootcamp",
    "Social Media Marketing for Real Estate",
    "Virtual Assistant Mastery Program",
    "Customer Service Excellence Certification"
  ]
}