{
  "name": "",
  "email": "",
  "phone": "",
  "location": "",
  "summary": "",
  "skills": [
    "AutoCAD",
    "AutoRebar plugin",
    "SketchUP",
    "Lumion 3D",
    "Advance Excel for CAD"
  ],
  "experience": [
    {
      "company": "Ascent Development Construction Inc.",
      "location": "Strata100 Ortigas Center, Pasig City",
      "duration": "October 3, 2018 — November 2021",
      "position": "Operation Architect/Architect of Records",
      "description": [
        "Attend Bid Meetings with Engineering Team, Clarifications at Mega World Head Office, Samsung Office and other Government Centers.",
        "Monitor of all the Concrete & Rebars requirements of the Project.",
        "Coordinate with Arcadis & Mace & Commercial Team of the Purchase Requisition of all the assigned Owner Supply Materials of the Project.",
        "Email requests and confirmation of updated reconciled Guaranteed Maximum Quantity (GMQ) of QS team (Arcadis) & Contractors.",
        "Notify Contractors of the exceeded Materials Ordered in their submitted Initial or Reconciled GMQ.",
        "Email Contractor, Project Management Team & Suppliers to resolve issues on Site.",
        "Set meeting with Suppliers, Arcadis, Mace team & Contractors with Procurement Team to resolve big issues happened in Construction to avoid delays and issues to arise.",
        "Procurement Strategy: Including but not limited to sending email requests to Suppliers of Materials needed in the Project and set meeting to discuss for their Best & Final Offer.",
        "Set trial mix schedule with Suppliers & inform QAQC team of the next testing schedule to witness the materials strength if it has a passing rate in line with its curing age.",
        "Attend Suppliers BAFO meeting with Department Head (Director) & Vice President of the Company.",
        "Attend meeting with other Departments and top management to discuss schedules and deliveries of materials and etc.",
        "Sourcing of Hotels Maintenance Materials in Plumbing & etc."
      ]
    },
    {
      "company": "SBR Construction Builders Inc. (SBRCBI)",
      "duration": "July 09, 2022 – March 07, 2025",
      "position": "Project In-Charge – Sheraton Hotel, Nagtabon Beach, Puerto Princesa Palawan",
      "description": [
        "Project Master Schedule (MS Project), Equipment Loading Plan, Diesel Plan, Manpower Loading Plan, Construction Financial Statement (CFS)",
        "Initial Lot Topo (Google Earth, gpsvisualizer, tpx converter)",
        "Shop Drawings of Land Development Design (section of driveways with topo)"
      ]
    },
    {
      "company": "Project Architect Representative for Megaworld Bidding Projects",
      "location": "Chelsea Parkplace, Pampanga",
      "duration": "January 2021 - November 2021",
      "position": "Head office Representative & Site Supervisor (Korean Cultural Center of the Philippines)",
      "description": [
        "Site Supervision (Demolition & Renovation Works)",
        "Site Coordination with Subcontractors of Architectural, Plumbing, Electrical, Mechanical & Electronic & Communication.",
        "Follow up Request for Inspections and Approvals of Project Construction Designs and Materials.",
        "Attend regular weekly meeting with the owner's side project management team for updates and reconcile.",
        "Conduct Site walkthrough and site inspection.",
        "Process Project Legal Documents; Permits & Clearances (Demolition Permit, Renovation Permit, Locational Clearance, Fire Clearance, Water Permit, Electrical Permit, AITF Permit for Construction during Covid lockdown, Tax Clearance, Occupancy Permit.",
        "Assist Operation Manager and coordinate with the whole engineering team for the preparations of documents for Company Bidding.",
        "Architectural Estimates of Bid Projects and etc.",
        "Assist Operation Manager in Monitoring of all Company Projects.",
        "Regularly conduct Site Visit with head office staffs of all ongoing Projects in Clark Pampanga and Laguna.",
        "Keeping of all Projects Contract Documents, Project Sites Work Progress, Budget Plans, etc."
      ]
    },
    {
      "company": "JVAC Inc.",
      "location": "Banwa Island Resort, Roxas Palawan",
      "duration": "June 2017 – August 2017",
      "position": "Site Architect",
      "description": [
        "Coordinate with Manosa Architect for Design details, revisions, changes, updates and etc.",
        "As Built Plans",
        "Site Visit, Inspection, Analysis for actual measurements of structures.",
        "Estimates of Floor Tiles."
      ]
    },
    {
      "company": "GTC Global Inc.",
      "location": "Hilton Hotel, Sunvalley Clark, Pampanga",
      "duration": "September 2016 – May 2017",
      "position": "AutoCAD, QA/QC",
      "description": [
        "Shop Drawings, Request for Approvals & Request for Inspection",
        "Prepare Site Activities and Updates daily and weekly reports.",
        "Rebars Estimate – actual cutting lists.",
        "CHB Estimates",
        "Attend Regular Meeting with ownerside project management team of site updates, reconciles and solutions.",
        "Proposed Layouts of all Hotel rooms classifications (studio, standard rooms, deluxe and VIPs).",
        "Supervised Mock up Interiors, Quality Check, Punch lists and conduct walkthrough."
      ]
    },
    {
      "company": "Midong Phil.",
      "location": "Puerto Princesa International Airport – Puerto Princesa City, Palawan",
      "duration": "January 2016 – June 2016",
      "position": "AutoCAD",
      "description": [
        "Site Inspection and actual measurements of Old Telecommunication Facilities.",
        "Daily, Overtime and Weekly Progress Reports.",
        "Shop Drawings (RFI/RFA) of new Airport Telecommunication Lines and devices.",
        "Actual Site Surveys with Engineering team of the new DVOR location including vegetation; the height and width of trees within 150m radius from DVOR center to be cleared of obstruction for airport signals and safety of every flights communication.",
        "Proposed Design Layout of Control Tower Interior including telecommunication devices.",
        "Proposed Design Layout of DVOR site facility to be approved by the consultant."
      ]
    }
  ],
  "education": [
    {
      "institution": "Palawan State University",
      "degree": "Bachelor of Science in Architecture",
      "year": "2008-2015"
    },
    {
      "institution": "PPSAT – Puerto Princesa School of Arts & Trades (TESDA)",
      "degree": "Plumbing NC 2, Electrical NC 2",
      "year": "2013"
    }
  ],
  "certifications": [
    "Registered Architect",
    "Registered Master Plumber"
  ],
  "projects": [
    "Google Earth",
    "Gpsvisualizer",
    "Tpx converter"
  ],
  "seminars": [
    {
      "provider": "Upswing Learning Center CPD Provider",
      "events": [
        "February 2019 – Sustainable Project Management",
        "March 2019 – Project Cost Control & Monitoring in Construction",
        "March 2019 – Pert/CPM for Project Scheduling and Monitoring",
        "March 2019 – Introduction to Construction and Project Management"
      ]
    },
    {
      "provider": "UAP Singapore Chapter",
      "events": [
        "September 2020 – Green Architecture the impact on the living environment"
      ]
    },
    {
      "provider": "UAP Dubai Chapter",
      "events": [
        "October 2020 – Zaha Hadid Architectural Iconic Buildings and Conceptual idea."
      ]
    },
    {
      "provider": "Data Privacy Awareness",
      "events": [
        "June 19, 2025 – Hann Casino Resorts HR Training Room 1"
      ]
    }
  ],
  "references": [
    {
      "name": "Ar. Willy Malonga",
      "position": "DOTr Airport Consultant",
      "phone": "0917 890 3280"
    },
    {
      "name": "Engr. Joey Barol",
      "position": "Midong Puerto Princesa Airport Telcom Engr.",
      "phone": "0932 342 6802"
    },
    {
      "name": "Engr. Charlie Hilario",
      "position": "GTC Global Inc. Hilton Hotel Project Head Engineer",
      "phone": "0916 544 7100"
    },
    {
      "name": "Engr. Osias Cases",
      "position": "Donggwang Clark Corp Project In-Charge (ownerside)",
      "phone": "0933 854 9874"
    },
    {
      "name": "Archt. Amiel Dizon",
      "position": "Hann Philippines Inc. Asst. Procurement Manager – Mace",
      "phone": "0917 107 7155"
    }
  ]
}